app/controllers/posts_controller.rb

  def index
    # provide a list of authors to the view for the filter control
    @authors = Author.all
---
SELECT "authors".* FROM "authors"